// kadai08b 2023年06月09日

#include <iostream>
#include <fstream>
#include <regex>
#include <string>

int main(int argc, const char* argv[]) {
    if (argc != 2) {
        std::cerr << "usage: " << argv[0] << " FILE" << std::endl;
        exit(1);
    }

    std::ifstream ifs(argv[1]);
    if (!ifs) {
        std::cerr << "open failed: " << argv[1] << std::endl;
        exit(2);
    }

    std::string text {
        std::istreambuf_iterator<char>{ifs},
        std::istreambuf_iterator<char>{}
    };

    ifs.close();

    // std::regex regex{R"(/\*((?!\*/).|\n)*\*/|//.*\n)"};
    std::regex regex{R"(/\*((?!\*/).|\n)*\*/|//.*$)"};
    auto format = "\033[31m$0\033[0m";
    auto flags = std::regex_constants::match_any;
    // auto flags = std::regex_constants::match_any | std::regex::multiline;
    /*
    c++しんしんしんしんしんしにｓんしんしんしにんしｓにんしにあないｓにあにんしあにｓにあんしないｓないｓにあんしあしあにｓになしないｓにあｓにあｓにｓにあにんし
    cppppppppppppppppppppppppppppppppppppppppppppppppppppppppppp
    しんしんしいｓにんしししいししんしｓんししｓんしんっしねしえんせにせんしえにせしねいｓねいｓねいｓねいんしねいｓねいんしえんしねいｓねいんしえんしねいんしえにｓねいんしねしねいんしにねせにｓねいしえにｓねいしえんせいんせにせにｓねいんしえにいｓねいｓねいｓね
    ｃ＋＋しんせいんせいんせいんしえんしえにｓねんしえにせにせいんせにｓんせいんしえんしねしえんしえにｓねいんしねいｓねいしねｓねいんｓねいｓねいｓねいせんしえねしんしねしねｓねいｓねんしねいんしえんしねいｓねいしえんしねんせいんしねいｓねいんせにせいんしねいｓねいｓねにせにせ
    ｃPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCPPPPPPPPPPPPPPP
    ころｋｓろｋｓろｋそｒこｋｓろｋｓろこｓｒこｓろｋそｋろそｒっこｓろこｓｋろｋそｒこｓｋろこｓｋろこｓｋろｋそｒこｓｋろこｓｋろｋそｒこそｒこｓｋろそろｓろおｓｋｓるこｓくろうｓろうこすろうこそるそｒこｓるおすろｋｓころｓｋろうｓろこｓｒｋ
    おｓｒこすｒこそｋろすｋろｋそｒこｓるこそうｋろｓろうｋそるｓろうこｓｒこｓｒこｓるこｓるこｓるこるｓｋｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ++っｃ++ｃ++ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+っｃ+++ｃ+ｃ+ｃ+ｃ++ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+っｃ++ｃ+ｃ+っｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ++っｃ+っｃ+
    しぷｓ−ｐすいぢしうｄ＠ーいうｐｓｄ−うそうｓ−そいいうおすｓ−いｐ−いうーーぴｓ−ぴーぷーｐ−しｐ−ｐすｐ−しーｓらーｐ−ｄｐ−あーｐづおうーあぷーあいうーｄ−ｄ−ｐｒ−ｄぴｐｒｐ−えーづいーｐ−ｒぴーづｒ−ｐｄるーｄｐｒぷｄ−−ｄｒ−ｐ−ぷｄｒぴうｄ−ｐるーｒｄぷ
    しえんせいんしねいｓねいんしにｓねいんせいんしえにｓねいんしえんしねしえにｓねいｓねいｓにねいんせいんしえにｓねいんしねいんしえにｓねいえいｓにｓねいｓにｓにえんしねしえにｓにえにｓねいんｓにえんしねｓねいんしえにｓねいｓねいんしえにせんいせにｓにえんしえんしえんｓねいんしねいしえにせんしえにしえねいせ

    ｃ+あｓｃ+あ+か++ｃ+か+あ++ｃ+あｃ+あｓｃ++ｓか+ｃ++ｃ+か+ｃ+あｃ++ｃ++ｓ+ｃ+ｃ+ｓ+ｃ+ｃ+ｓ+ｃ++ｃ+ｃ+ｃ+ｃ++ｃ+++ｃ+ｃ+ｃ+ｃｓ+ｃ+++ｃ+ｓ+ｃ+ｓｃ
    ころすろｓｋろおすろっこおうおｋそｒくうｓこるおｓるおすろくおすこうｓろうこｓｒこすｋｒこｓくろすこｋろすｋろくそうｋそｒこｓｒこそるｋｓこるおすｋろｓるっｋそるｋそるこすｒこｓｋろうｋそｒくおすｒこｓｋろｓるこｓｋろｓくろｋそるｋそうｋろｓｋろｓくｒこｓるｋそｋろｓｋろｋそるｋそうｋろｋすおるこすｋろｓくろくそｋるおすｋるそｋろｓｒ
    ししににｒにｓりんしｒんｓんりりｓんｒんしにえにせいんせいんしんしえいにえんしねいんしえにせいんしねいｓにえにｓねいｓにえんしねいんせいにｓねんしえにｓねいんしえいせにｓねんしえにんせいんせにｓねいｓにえにせにｓねいんしねしえいｓねにせにんしえにｓねいんしえにしえにｓねんしえにせにｓにえんしえにせいにｓねいんせいんしねいｓにねいしねしねいんせんしえんｓにえいせんしえにせいんしえにｓねせ
    ｃ+ｓｃ+ｃ+ｓっｃ+ｃ+っｃ++ｃ+ｃ+ｃ++っっｃｐ+ｃｐ++ｐｃ+ｃｐ+ｃｐ+ｃｐ+ｃ+ｐ+ｃｐ++ｃｐ+ｃ+ｐ+ｃ+ｐ+ｃｐ++ｃｐ+ｃ+ｐ+ｃ+ｐ++ｐｃ+ｃ++ｃｐ++ｃ+ｐｃｐｃｐ++ｃ+ｃ+ｃ+ｃ+ｐ+ｃ++++++++++++++っっっっっっっっっっっっっっっっっっっっっっｃｐｃｐｃｐ++ｃｐ+ｃｐ
    こるおそるおｓころうｒこｋそうろうそこうそうこｒすこるそくおｓｒくおるおすｒこｓこｒｋそｒこおすｋろくそるこｓるこｓくろうこすｋろｓこっくろすこｓｋろｓｋろすｋろｋそｋるおすこｓくおｒくおすｋろすっｋるおｓｋろｋそこｓｋろくすｋろｋすおるｋそうｋろｓｋろうｋそｒｋｓくろｋそｋろｓｋｒｋそおｋｒそうｋｒｓｒ
    しねいんせんしえにｓねいにｓねいんしえにんしえにんしえんしねいんしえにｓねいんしえにんしえんしえにｓにえんしねいｓにえにｓねいんせいにｓねいんしえにせにしえにせにｓねいんしねいｓねいんしねいんせいんしねいんしえにしえんｓねいんしえにｓねいんしえにｓねいんしえしねんしえねいｓにｓねいせんしえにせいしねえｓ」」
    ++++++ｃ+ｃ+ｃ++ｃ++っｃ++ｃ+ｃ+ｃ+っっっｃ+ｃ+ｃ++ｃ+ｃ+ｃ+ｃ++ｃ+っっｃ+ｃ+ｃ+ｃ+ｃ+ｃ+っｃ+ｃ++ｃ+ｃ++ｃ+ｃ+ｃ+ｃ++ｃ+ｃ+ｃ+ｃ+っｃ+っｃ++ｃ+っｃ+ｃ+ｃ++っｃ+++ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+っｃ+ｃ+ｃ++ｃ+ｃ++ｃ+ｃ+ｃ+ｃ+っっｃ+ｃ++ｃ+ｃ+っｃ+ｃ+ｃ+っっｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+++ｃ++ｃ+ｃ
    こｓろｓｋろすｒｋそｒこｓｊろじょくそるこｓくおろうこすろｋそるこすこくろうそｋるおすろｋそこｒすこすｋろｓくｒこうｋそうｋろすこｒこｓｋるおすｋろｓこるこｓｒｋｓにｓにｓにｓにんりｓりえにｓねいんせいんしねいｓねいしえんｓねいんせいんしえんｓねい
    せいんせにしえんｓねいんしえにせねいｓんえいｓねんしえんしえにｓねいｓねいんせにｓねいｓねしねんしねいｓねせいｓにえしねいｓねいんせいんしえしえんしねいせにｓねしえんしねんしえにｓねんしねいしえんせいせんしえにせしねしねんしねいせにせんしえんしえんしえんしえんしねいえｓにねｓんいえいんせ
    ｃ+ｃ+ｃ+ｃ++ｃ+ｃ++ｃ+っｃ+っｃ+ｃ++ｃ+ｃ+ｃ++ｃ+ｃ+ｃ+ｃ++ｃ+ｃ++ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+っｃ+ｃ+++ｃ++ｃ+っｃ++ｃ+++ｃ+ｃ++ｃ+っｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ++ｃ+ｃ+っｃ++ｃ+ｃ+ｃ+ｃ++ｃ++ｃ++っｃ+ｃ++ｃ+っｃ++ｃ++ｃ+っｃ+ｃ+ｃ+ｃ+ｃ+ｃ+++ｃ+ｃ+ｃ++ｃ+ｃ+ｃ+ｃ++ｃ+ｃ++ｃ++ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ++ｃ+ｃ+ｃ+ｃ+ｃ+っっｃ+ｃ+ｃ++ｃ+ｃ+っっｃ
    +ｃ+ｃ+ｃ+ｃ++ｃ+ｃ+こｒっころうおｋろおうおｓころｓろｋそるおｓｒこすそるこｓｒこｓるこすろｋそるくこｓｋろうｓｒこすｋろすｋｒこｓるｋすろおｓくるｋそるこｓくｒすｋｒｋそおるｓこｒこｓるっｋそｒこｓろｓｒくｓｒこうこｓｒくおｓｒくおｓｋｒｓｋるこｓｒくｓろｋｒｓｋｒすおｓｒこｓｒｓ
    ぢんせいんしえにｓねいんしえにんしえにｓねいｓねいにｓねいんしえにｓねいしねいんせいんｓねいせにせいせにんしえにせいしえにｓにえにｓねいｓねいんしえねんしねいしねいえんせねにせいねっぺえ
    ぺぺぺぺっぺっぺぺっぺっぺっぺぺぺぺっぺっぺっぺぺっぺぺっぺっぺっぺぺっぺえぺっぺぺっぺぺぺっぺぺっぺぺぺっぺぺぺっぺぺっっぺっぺぺぺぺぺぺぺぺぺっぺぺぺぺっぺぺぺっっぺっっぺっっっぺぺっぺぺぺっぺぺぺ
    ｃｐｃっｐっｃｐｃｐｃｐｃっｐｃｐｃｐｃｐｃっｐｃっｐｃｐｃｐｃｐｃっｐｃっｐｃｐｃｐｃｐｃｐｃっｐｃｐｃｐｃｐｃっｐｃっっｐｃっっっっｐっっっっっっｃっｐｃっｐｃｐｃｐｃｐｃｐっｃっｐｃｐｃｐｃｐｃｐｃｐｃｐｃｐｃっｐ
    えっぺっぺぺっっぺぺっっっっっぺっぺぺっぺっぺぺえっぺぺっぺっぺっぺぺっぺぺっぺぺぺっぺえっぺぺぺっっぺぺぺっぺっぺっぺぺぺっぺぺぺっぺぺぺぺぺぺっぺぺぺっぺぺっぺぺぺぺっぺぺぺっぺぺぺぺっぺぺぺっぺぺぺぺぺぺぺぺぺぺぺ
    ｃ+ｃ+ｃ+ｃ++ｃ+ｃ+ｃ++ｃ+ｃ+ｃ++++++++ｃ+ｃ++ｃ+ｃ++ｃ++ｃ+ｃ++ｃ+ｃ+ｃ+ｃ+ｃ+ｃ++ｃ+ｃ++っｃ+ｃ++ｃ++ｃ++ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+++ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ++ｃ++っっｃ+ｃ
    しんせんしえにｓねいいｓねいんしねいんせいんしねいｓねいんしえにｓねいんしねいｓにえにｓねんしねいｓねいんしえんせんしえにｓねしねいｓねいんしえにｓねいｓねいんしえんしえんしねいｓねいんしえんしねいｓねいｓにえんしねいんせいんしねいｓねんしえんしえんしねしねいんせんしえしえんｓねいいｓねんしえんしねいんせにｓねいせにんしえにｓねいんせいｓねいｓねいんしｓねいんせいねｓにんしえねしｓにねいｓねにせいｓねいんｓねいｓねいせにｓにえ
    こせおくそうえおうこｓるおすｋろうｋｓるこｓるこｓるこｓるこうｋそｒこｓくろうｓろうこｓｒくおうそるｋｓろうこｓるこｓるくｓｋろうｋｓろうｋｒそくろくそｒこｓｒくおｓるこすｒこうｋｓるこｓｋるおｓｋｒくｓろｋｓｒｋそうｋｒｋｓろｓｒくおうｋｓろうｓｒｋｓくろこｓｒこｓｋるｓるｋｓろおｓｒｋｓｒこｓろｓるこｓるおｓｋろすｒｋすｋろうｋｓｒくおｒｓくそｒｋｓｒくｓｒ
    しんせいんせいんしえんしえにせにせいんしえんしえんｓねいんしねいんしえにｓねいんしえにｓねいにえしねいえｓにねいｓにえんしねいんしえｓねいんしえんせいんしえんしえにｓねいんしねんせいにせにｓねいｓねいんしえねしねいせいねｓにねいしにえんｓんせにえｓにｓねいんせいｓねいせんしえにｓねいねｓにねしんしえにねしにんせにｓねいにえｓにんせいせせｃ
    ｃ+ｃ++ｃ+っｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ++ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ++ｃ+ｃ+ｃ+ｃ+っｃ++ｃ+ｃ++ｃ+ｃ+ｃ+ｃ+ｃ++ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ++ｃ+ｃ+ｃ+ｃ+ｃ+ｃ++ｃ+ｃ++ｃ+ｃ+ｃ+ｃ+++ｃ+ｃ+ｃ+ｃ++ｃ+ｃ+ｃ+ｃ+っｃ+ｃ+++ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ+ｃ
    5333533535353533535353533553535355353535353535353535355353535353535353535353553353535353535353535335353535353553335535353553535535355353535353533535353535353535353535533535353535535355335353353553535533535535335355353535353535353535353353535353533535353535
    ｋｓｋｓｋｓっｋｓｋっｓｋｓかｋさｋｓかｓっかｓかｓかｓかうｓくｓかうかうｓくｋさうｋすあくｓかうｋｓかうｋすかうｓくあｋすかくｓくあさすかすかｓくあｋｓかうｓくかすくかすくあｓくｋｓくあｓっくすくｓかうｓかうｓっかすかｓっかすかうｓくあｓくｓかうｋすかうｓかうｋすあくあうさくあｓくあｋすかうｓくあすかすかすっかすｋすかうすかうｓくかすｋすあｋすあくｓくあｋすかすかすかすあｓくかすかｓ
    くｋすｋすｋすｋそすこそくそくｋそうこすそうｓっｋすそうこｓｋっｓこすこうｓっっｋｓこｓｋｓくそうｓここすおすこうそｋそうそうｋそうｋそｋすおｋｓｋそおうｋすこくくおうｋｓこうすおすｋっそこｋすｓｋｓｋっｓくｓｋすこｋｓくｋすｋｓｋすうｓっこｓｋすｋっすくｋｓｋｓｋすそｋｓｋすこすおｋすｓｋｓこｋｓｋｓっｋｓｋｓｋそうｋすっｓこｓｋすうｓくｓっｋすｓくｋっｓくおおｓくｓｋすおｓくすくこｓｋっすっｋすｓくｓｋすｓｋすおｋすｓｋｓ
    おごごｍごもｇもｍぎおっｍごみおもごいｇもｇｍごいおいごｍｇｍごｍっごｍごｍごｍごぎみみｇｍごみおｇみおｇみおｍぎおｍぎおいもｇみおｍぎおみおいｍごいもぎもいｇもいｍごｍごいｍごみおｇみおぎおｍごいｍｇｍごいもぎｍごみごｍぎおｍぎｍごみごいｍごｍごみごもｍぎｍごｍぎおみごｍごみごｍごｍｇもぎｍごみおｍごｍｇもｇｍごｍぎおｍぎおみｇみおｍぎおｍぎおみごみぎごｍｇｍｇみおｍぎおみｇｍぎもいｇもいｍぎｍｇｍぎ
    ｃ+ｃ+ｃ++ｃ+ｃ+ｃ+ｃ++ｃ+ｃ+ｃ++ｃ+ｃ+ｃ++ｃ+ｃ++ｃ++ｃ+ｃ++ｃ+ｃ+++ｃ++ｃ+ｃ+ｃ+ｃ++ｃ+ｃ+ｃ++ｃ++ｃ+ｃ+ｃ+ｃ++ｃ+ｃ+ｃ++ｃ++ｃ+ｃ+ｃ++ｃ+++ｃ++っｃ+ｃ+ｃ++ｃ+ｃ++ｃ+ｃ++ｃ+ｃ+ｃ+ｃ+ｃ+っっｃ+ｃ+ｃ
    しｓねいんしえにんしえにｓにえにｓねいんしねいｓにえにｓねいんしえんしねいんしえんｓねんしねいｓにえんしねいｓねいｓにえんしねんしえんしねいｓねいｓねせんしえんしえんしえにせんしねしえにｓねいｓねんしえにせんｓにえしねｓにえんしえにｓねいんせいんしえにｓねいんせにｓねいｓねいんしえんしえんしえんしえんしえんせいｓねいんしえにんしえにｓねいいｓねｓねいんせにｓねいんせいにえんしねいねいんしえんせいんしえんせいんしえんせしねせいんせいせにｓねいｓねい
    こせｋろｓろくｓｒこｓるこくろするこくｋろｓｋそるこすｋろすｋろうｋそｒくおｓｋろｓｒこｓｋろｋそすこｒこｓｋｒそｋろｓｒこｓｋｒこｓｋるｋそうｋろくそｒこすｋろｓくｒｋｒくおｓるこｓｋｒこｓろｓこるｓｒこうｋすうｒすおるｋｓろうっくおｓろｋｒすこｒｋそｒｓｒｋそｋｒこすｋｒｓこｒくそｒこｓｋｒすこｒくｓくおｒｋｓるｓろくるｓｒこｓｋろそるｓｒくｓるおｋそｒこｓろくそｋろｓるこｓｒそｒｓろこｓｒｓｋ
    ｐｒっｐｒｐｒｐっｒっっぺっぺぺぺっぺぺっっぺぺぺっぺっぺぺっぺぺぺぺっぺぺぺっぺぺぺぺぺっぺぺぺぺっぺぺっぺっぺぺっぺっぺぺっぺぺぺぺぺっぺぺぺっぺぺっぺえっぺっっぺっぺぺぺぺっぺぺぺっっぺぺぺぺ
    */

    auto replaced_text = std::regex_replace(text, regex, format, flags);

    std::cout << replaced_text << std::endl;
}

/* 実行結果 **********************************************************/
// 2XXXX1@ISE7Cu:~/Practical-Programming/20230609$ g++ kadai08a.cpp -o kadai08a && ./kadai08a <(echo $'/*\n * プログラミング言語C++\n */\nint main() { // line commant\n    return /* block */ 0 /* comments */;\n}')
// /*
//  * プログラミング言語C++
//  */
// int main() { // line commant
//     return /* block */ 0 /* comments */;
// }
/*********************************************************************/
